Autodesk.Revit.DB.FloorTypeSet
A set that contains floor types.

Autodesk.Revit.DB.FloorTypeSet.Insert(Autodesk.Revit.DB.FloorType)
System.Int32
Insert the specified floor type into the set.
item: The floor type to be inserted into the set.
Returns: Returns whether the floor type was inserted into the set.

Autodesk.Revit.DB.FloorTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.FloorTypeSet.ReverseIterator
Autodesk.Revit.DB.FloorTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.FloorTypeSet.ForwardIterator
Autodesk.Revit.DB.FloorTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.FloorTypeSet.Erase(Autodesk.Revit.DB.FloorType)
System.Int32
Removes a specified floor type from the set.
item: The floor type to be erased.
Returns: The number of floor types that were erased from the set.

Autodesk.Revit.DB.FloorTypeSet.Contains(Autodesk.Revit.DB.FloorType)
System.Boolean
Tests for the existence of a floor type within the set.
item: The floor type to be searched for.
Returns: The Contains method returns True if the floor type is within the set, otherwise False.

Autodesk.Revit.DB.FloorTypeSet.Clear
void
Removes every floor type from the set, rendering it empty.

Autodesk.Revit.DB.FloorTypeSet.Size
System.Int32
get
Returns the number of floor types that are in the set.

Autodesk.Revit.DB.FloorTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.